 <h1 class="title">更新情報</h1>
 <p>2012/10/16 Ver 1.26 PERL_MM_OPT が設定されている環境で initcpan コマンドが異常終了する問題に対処。</p>
 <p>2012/9/28 Ver 1.25 Ver 1.24 から git/hg/svn 以外の URL が動かなくなっていたのを緊急に修正。</p>
 <p>2012/9/12 Ver 1.24 git/hg/svn サポートを追加。tar ball ではなくリポジトリからダウンロード可能。試験的に Mac サポートを追加。</p>
 <p>2012/7/20 Ver 1.23 tcsh/csh 環境で動かなかったのを fix したつもり。</p>
 <p>2012/6/26 Ver 1.22 Crypt::SSLeay が入っていない環境でも動くように書き換え。</p>
 <p>2012/6/26 Ver 1.21 git URL がサポートされた。メッセージ改良。copyrep 増設。</p>
 <p>2012/6/13 Ver 1.20 古い Perl で initlocaldir が動かなくなっていたのを修正。</p>
 <p>2012/4/12 Ver 1.19 opt ディレクトリを追加。</p>
 <p>2012/3/27 英語版MLを設立。</p>
 <p>2012/3/25 Ver 1.18 lpm スクリプトが DOS 改行(CR+LF)でも CR を自動で取り除くように修正。</p>
 <p>2012/2/3 Ver 1.17 sourceforge の新しい仕様に追従できていなかったので initlocaldir が出来ない問題を修正。</p>
 <p>2011/9/22 Ver 1.16 updatelpm コマンドが完全にバグっていたのを直した. lpm initlocaldir --local=hoge したときに hoge がデフォルトになるように修正。</p>
 <p>2011/9/4 Ver 1.15 プロキシに対応</p>
 <p>2011/9/1 Ver 1.14 ダウンロード済みファイルを再利用できるように(主にlpm script のデバッグ用). topdirname 追加.</p>
 <p>2011/8/3 Ver 1.13 インストール済みパッケージ一覧の取得ができるように</p>
 <p>2011/6/13 Ver 1.12 Perl module 用コードのバグ修正, パラメータを保存しつつアップデート可能に</p>
 <p>2011/5/18 Ver 1.11 メッセージ拡充。sourceforge コマンドを追加</p>
 <p>2011/5/8 Ver 1.10 lpm help のメッセージ拡充。ssconfig コマンドを追加</p>
 <p>2011/4/27 Ver 1.09 インストールスクリプト用に環境変数をいくつか追加。lpm script 用のドキュメントも修正。lpm list のエラーメッセージ拡充。</p>
 <p>2011/4/24 Ver 1.08 Ruby のバージョン番号に対応。1.07 で導入したコンパイラチェックのバグ修正。(Thanks to T. Nishiyama)</p>
 <p>2011/4/22 Ver 1.07 sourceforge の HTML ページ仕様変更に対応。生成スクリプトに余計な改行が入る問題に対処。(Thanks to T. Nishiyama)</p>
 <p>2011/3/6 Ver 1.06 インストール時に uudecode が無くても動くように変更。コンパイラの有無を先にチェックするように変更。</p>
 <p>2011/2/27 Ver 1.05 自己 update に対応。</p>
 <p>2010/10/24 Ver 1.04 ローカルファイルの tar ball をインストールできないバグ fix。</p>
 <p>2010/9/22 (日本語)MLを作りました。</p>
 <p>2010/?/?? LPMをリリース。</p>

